<!-- dflook/terraform-github-actions {"workspace":"opentofu-cloud-2","backend_type":"remote","backend":"418df1e5caf88bd1ab3c7a21a0d80193cdfc1c14dc04d15617333f30b722ac52","plan_job_ref":"Job Test Terraform cloud #176 at https://github.com/dflook/terraform-github-actions/actions/runs/6592484872","plan_hash":"7b065b23732cc1e9713a1758c56765a4bff0c1984934d5933ff0947f13382a49","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/partial__ in the __opentofu-cloud-2__ workspace
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id  = (known after apply)
  + len = 5
```
</details>

:memo: Plan generated in [Test Terraform cloud #176](https://github.com/dflook/terraform-github-actions/actions/runs/6592484872)